wolaite2024/jlab-jh5003-earphone/src/mcu/io/rtl87x3eu/rtl_ethernet.c
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
**********************************************************************************************************
* \file     rtl_ethernet.c
* \brief    This file provides all the ETHERNET firmware functions.
* \details
* \author   colin
* \date     2024-06-28
* \version  v1.0
*********************************************************************************************************
*/

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "rtl_ethernet.h"
#include "rtl876x_rcc.h"
#include "trace.h"
#include "platform_utils.h"

/*============================================================================*
 *                          Private Variable
 *============================================================================*/
ETHPHYOps_TypeDef ETH_PHY_OPS = {0};

/*============================================================================*
 *                          Private Functions
 *============================================================================*/
extern void ETH_ClockDeInit(void);

/*============================================================================*
 *                           Public Functions
 *============================================================================*/
/**
  * \brief  Init PHY operations.
  * \param  phy_ops: PHY operations.
  * \return none.
  */
void ETH_PHYOpsInit(ETHPHYOps_TypeDef *phy_ops)
{
    memcpy(&ETH_PHY_OPS, phy_ops, sizeof(ETHPHYOps_TypeDef));
}

/**
  * \brief  Write PHY register.
  * \param  phy_addr: PHY address.
  * \param  address: PHY's register address.
  * \param  data: The data to be written to the above register address.
  * \return The result of the write operation.
  *         true: write success
  *         false: write failed
  */
bool ETH_WritePHYRegister(uint8_t phy_addr, uint8_t reg_address, uint16_t reg_data)
{
    uint32_t i = 0;

    ETH_MIIAR_TypeDef eth_reg_0x5c = {.d32 = ETH->ETH_MIIAR.d32};
    eth_reg_0x5c.b.flag = PHY_REG_WRITE_MODE;
    eth_reg_0x5c.b.phy_address = phy_addr;
    eth_reg_0x5c.b.reg_addr4_0 = reg_address;
    eth_reg_0x5c.b.data15_0 = reg_data;
    ETH->ETH_MIIAR.d32 = eth_reg_0x5c.d32;

    while (ETH->ETH_MIIAR.b.flag)
    {
        platform_delay_us(1);
        i++;
        if (i > ETH_TIMEOUT_CNT_MAX)
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR,
                           "ETH_WritePHYRegister: Wait write operation flag timeout!!", 0);
#endif
            return false;
        }
    }

    return true;

}

/**
  * \brief  Read PHY register.
  * \param  phy_addr: PHY address.
  * \param  address: PHY's register address.
  * \return The result of the read register data.
  */
uint16_t ETH_ReadPHYRegister(uint8_t phy_addr, uint8_t reg_address)
{
    uint32_t i = 0;

    ETH_MIIAR_TypeDef eth_reg_0x5c = {.d32 = ETH->ETH_MIIAR.d32};
    eth_reg_0x5c.b.flag = PHY_REG_READ_MODE;
    eth_reg_0x5c.b.phy_address = phy_addr;
    eth_reg_0x5c.b.reg_addr4_0 = reg_address;
    eth_reg_0x5c.b.data15_0 = 0;
    ETH->ETH_MIIAR.d32 = eth_reg_0x5c.d32;

    while (ETH->ETH_MIIAR.b.flag == 0)
    {
        platform_delay_us(1);
        i++;
        if (i > ETH_TIMEOUT_CNT_MAX)
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR,
                           "ETH_ReadPHYRegister: Wait read operation flag timeout!!", 0);
#endif
            return 0;
        }
    }

    return (uint16_t)((ETH->ETH_MIIAR.d32) & 0xFFFF);
}

/**
  * \brief  Set the Tx/Rx descriptor number.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  tx_desc_no: The specified Tx descriptor number.
  * \param  rx_desc_no: The specified Rx descriptor number.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_SetDescNum(ETH_InitTypeDef *ETH_InitStruct, uint8_t tx_desc_no,
                                      uint8_t rx_desc_no)
{
    if ((ETH_InitStruct == NULL) || (tx_desc_no == 0) || (rx_desc_no == 0))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_SetDescNum: Invalid parameter!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }
    if (((tx_desc_no * sizeof(ETHTxDesc_TypeDef)) % 32) ||
        ((rx_desc_no * sizeof(ETHRxDesc_TypeDef)) % 32))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR,
                       "ETH_SetDescNum: The size of Tx/Rx descriptor ring must be 32-Byte alignment!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }

    ETH_InitStruct->ETH_TxDescNum = tx_desc_no;
    ETH_InitStruct->ETH_RxDescNum = rx_desc_no;

#ifdef DEBUG_ETH
    ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO, "ETH_SetDescNum: ETH_TxDescNum=%d,ETH_RxDescNum=%d", 2,
                   ETH_InitStruct->ETH_TxDescNum, ETH_InitStruct->ETH_RxDescNum) ;
#endif

    return ETH_STATUS_OK;
}

/**
  * \brief  Set the start address of Tx/Rx descriptor ring.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  tx_desc: The start address of Tx descriptor ring.
  * \param  rx_desc: The start address of Rx descriptor ring.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_SetDescAddr(ETH_InitTypeDef *ETH_InitStruct, uint8_t *tx_desc,
                                       uint8_t *rx_desc)
{
    if ((ETH_InitStruct == NULL) || (tx_desc == NULL) || (rx_desc == NULL))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_SetDescAddr: Invalid parameter!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }
    if ((((uint32_t)tx_desc) & 0x1F) || (((uint32_t)rx_desc) & 0x1F))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR,
                       "ETH_SetDescAddr: The descriptor address must be 32-Byte alignment!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }

