wolaite2024/jlab-jh5003-earphone/src/mcu/io/rtl87x3eu/rtl_ethernet.c
    ETH_InitStruct->ETH_TxDesc = (ETHTxDesc_TypeDef *)tx_desc;
    ETH_InitStruct->ETH_RxDesc = (ETHRxDesc_TypeDef *)rx_desc;

    return ETH_STATUS_OK;
}

/**
  * \brief  Set the start address of Tx/Rx packet buffer.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  tx_pkt_buf: The start address of Tx packet buffer.
  * \param  rx_pkt_buf: The start address of Rx packet buffer.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_SetPktBuf(ETH_InitTypeDef *ETH_InitStruct, uint8_t *tx_pkt_buf,
                                     uint8_t *rx_pkt_buf)
{
    if ((ETH_InitStruct == NULL) || (tx_pkt_buf == NULL) || (rx_pkt_buf == NULL))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_SetPktBuf: Invalid parameter!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }
    if ((((uint32_t)tx_pkt_buf) & 0x1F) || (((uint32_t)rx_pkt_buf) & 0x1F))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR,
                       "ETH_SetPktBuf: The packet buffer address must be 32-Byte alignment!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }

    ETH_InitStruct->ETH_TxPktBuf = tx_pkt_buf;
    ETH_InitStruct->ETH_RxPktBuf = rx_pkt_buf;

    return ETH_STATUS_OK;
}

/**
  * \brief  Set the ethernet MAC address.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  addr: The specified MAC address.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_SetMacAddr(ETH_InitTypeDef *ETH_InitStruct, uint8_t *addr)
{
    if ((ETH_InitStruct == NULL) || (addr == NULL))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_SetMacAddr: Invalid parameter!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }

    memcpy((void *)(ETH_InitStruct->ETH_MacAddr), addr, MAC_ADDR_LEN);

    return ETH_STATUS_OK;
}

/**
  * \brief  Get the ethernet MAC address.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  addr: The buffer of MAC address.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_GetMacAddr(ETH_InitTypeDef *ETH_InitStruct, uint8_t *addr)
{
    if ((ETH_InitStruct == NULL) || (addr == NULL))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_GetMacAddr: Invalid parameter!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }

    memcpy((void *)addr, ETH_InitStruct->ETH_MacAddr, MAC_ADDR_LEN);

    return ETH_STATUS_OK;
}

/**
  * \brief  Set buffer size.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  tx_alloc_buf_size: Allocated tx buffer size.
  * \param  rx_alloc_buf_size: Allocated rx buffer size.
  * \param  tx_buf_size: The tx buffer size that can be used actually.
  * \param  rx_buf_size: The rx buffer size that can be used actually.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_SetBufSize(ETH_InitTypeDef *ETH_InitStruct, uint16_t tx_alloc_buf_size,
                                      uint16_t rx_alloc_buf_size, uint16_t tx_buf_size, uint16_t rx_buf_size)
{
    if ((ETH_InitStruct == NULL) ||
        ((tx_alloc_buf_size - 8) < tx_buf_size) ||
        ((rx_alloc_buf_size - 8) < rx_buf_size))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_SetBufSize: Invalid parameter!!", 0);
#endif
        return ETH_STATUS_ERROR;
    }

    ETH_InitStruct->ETH_TxAllocBufSize = tx_alloc_buf_size;
    ETH_InitStruct->ETH_RxAllocBufSize = rx_alloc_buf_size;
    ETH_InitStruct->ETH_TxBufSize = tx_buf_size;
    ETH_InitStruct->ETH_RxBufSize = rx_buf_size;

    return ETH_STATUS_OK;
}

/**
  * @brief  Init ETH clock.
  * @param  None.
  * @return None.
  */
void ETH_ClkInit(void)
{
    RCC_PeriphClockCmd(APBPeriph_GMAC, APBPeriph_GMAC_CLOCK, ENABLE);
}

/**
  * \brief  Initialize the ethernet MAC controller and PHY RTL8201FR.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \return ETHErrorStatus_Typedef: The status of ETH. \ref ETHErrorStatus_Typedef.
  */
ETHErrorStatus_Typedef ETH_Init(ETH_InitTypeDef *ETH_InitStruct)
{
    uint32_t i, start_us;
    uint16_t tmp;

    /* reset MAC */
    ETH->ETH_CR.b.rst = 1;
    i = 0;
    do
    {
        i++;
        if (i > ETH_TIMEOUT_CNT_MAX)
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_Init: Wait reset MAC timeout!!", 0);
#endif
            break;
        }
    }
    while (ETH->ETH_CR.b.rst);

    /* Init PHY */
    if (ETH_InitStruct->ETH_Mode != ETH_LOOPBACK_T2R_MODE)
    {
        /* Disable MAC's auto-polling */
        ETH->ETH_MIIAR.b.disable_auto_polling = 1;

        /* Need delay, otherwise will cause write phy failed */
        platform_delay_ms(1);

        if (ETH_PHY_OPS.ETH_ResetPHY != NULL)
        {
            ETH_PHY_OPS.ETH_ResetPHY();
        }

        if (ETH_InitStruct->ETH_PhyMode == ETH_PHY_LOOPBACK_MODE)
        {
            if (ETH_PHY_OPS.ETH_PHYLoopback != NULL)
            {
                ETH_PHY_OPS.ETH_PHYLoopback(ETH_InitStruct);
            }
        }
    }

    /* RMII interface */
    ETH->ETH_MSR.b.reg_rmii2mii_en = 1;
    /* REFCLK on */
    ETH->ETH_MSR.b.refclk_on = 1;
    ETH->ETH_MSR.b.sel_rgmii = 0;

    /* set refclk phase */
    ETH->ETH_MSR.b.rx_refclk_phase = ETH_InitStruct->ETH_RxRefclkPhase;
    ETH->ETH_MSR.b.tx_refclk_phase = ETH_InitStruct->ETH_TxRefclkPhase;

    ETH->ETH_TCR.b.inter_frm_gp_tm = ETH_InitStruct->ETH_InterFrameGapTime;
    ETH->ETH_TCR.b.lpbk = ETH_InitStruct->ETH_Mode;

    /* Rx settings */
    ETH->ETH_IDR0.d32 = ((ETH_InitStruct->ETH_MacAddr[0]) << 24) | ((
                                                                        ETH_InitStruct->ETH_MacAddr[1]) << 16) | ((ETH_InitStruct->ETH_MacAddr[2]) << 8) |
                        (ETH_InitStruct->ETH_MacAddr[3]);
    ETH->ETH_IDR4.d32 = ((ETH_InitStruct->ETH_MacAddr[4]) << 24) | ((
                                                                        ETH_InitStruct->ETH_MacAddr[5]) << 16);
    ETH->ETH_RCR.d32 = ETH_InitStruct->ETH_ReceiveConfig;
    ETH->ETH_CR.b.rx_jumbo = ETH_InitStruct->ETH_RxJumboConfig;

    ETH_CPU->ETH_ETHRNTRXCPU_DES_NUM1.d32 = ETH_CPU_ETH_0X130_DEFAULT_VALUE;

    /* I/O command */
    ETH_CPU->ETH_IO_CMD1.d32 = ETH_CPU_ETH_0X138_DEFAULT_VALUE;
    ETH_CPU->ETH_ETHER_IO_CMD.d32 =
        ETH_CPU_ETH_0X134_DEFAULT_VALUE;
    ETH_CPU->ETH_ETHER_IO_CMD.b.tsh = ETH_InitStruct->ETH_TxThreshold;
    ETH_CPU->ETH_ETHER_IO_CMD.b.rxfth = ETH_InitStruct->ETH_RxThreshold;
    ETH_CPU->ETH_ETHER_IO_CMD.b.tx_int_mitigation_2_0 = ETH_InitStruct->ETH_TxTriggerLevel;
    ETH_CPU->ETH_ETHER_IO_CMD.b.rx_int_mitigation_2_0 = ETH_InitStruct->ETH_RxTriggerLevel;

    ETH_CPU->ETH_TXFDP1.d32 = (uint32_t)(ETH_InitStruct->ETH_TxDesc);
    ETH_CPU->ETH_RXFDP1.d32 = (uint32_t)(ETH_InitStruct->ETH_RxDesc);

