wolaite2024/jlab-jh5003-earphone/src/mcu/io/rtl87x3eu/rtl_ethernet.c
    /* initialize Tx descriptors */
    for (i = 0; i < (ETH_InitStruct->ETH_TxDescNum); i++)
    {
        if (i == ((ETH_InitStruct->ETH_TxDescNum) - 1))
        {
            ETH_InitStruct->ETH_TxDesc[i].dw1 = ETH_TX_DESC_EOR;
        }
        ETH_InitStruct->ETH_TxDesc[i].addr = (uint32_t)(ETH_InitStruct->ETH_TxPktBuf +
                                                        (i * ETH_InitStruct->ETH_TxAllocBufSize));
        ETH_InitStruct->ETH_TxDesc[i].dw3 = 0;
        ETH_InitStruct->ETH_TxDesc[i].dw4 = 0;
    }

    /* initialize Rx descriptors */
    for (i = 0; i < (ETH_InitStruct->ETH_RxDescNum); i++)
    {
        if (i == ((ETH_InitStruct->ETH_RxDescNum) - 1))
        {
            ETH_InitStruct->ETH_RxDesc[i].dw1 = ETH_RX_DESC_OWN | ETH_RX_DESC_EOR |
                                                ETH_InitStruct->ETH_RxBufSize;
        }
        else
        {
            ETH_InitStruct->ETH_RxDesc[i].dw1 = ETH_RX_DESC_OWN | ETH_InitStruct->ETH_RxBufSize;
        }
        ETH_InitStruct->ETH_RxDesc[i].addr = (uint32_t)(ETH_InitStruct->ETH_RxPktBuf +
                                                        (i * ETH_InitStruct->ETH_RxAllocBufSize));
        ETH_InitStruct->ETH_RxDesc[i].dw2 = 0;
        ETH_InitStruct->ETH_RxDesc[i].dw3 = 0;
    }

    /* clear cnt */
    ETH->ETH_TXOKCNT.d16 = 1;
    ETH->ETH_RXOKCNT.d16 = 1;
    ETH->ETH_TXERR.d16 = 1;
    ETH->ETH_RXERR.d16 = 1;
    ETH->ETH_MISSPKT.d16 = 1;

    /* disable int and clear int status */
    ETH->ETH_ISR_IMR.d32 = 0xffff;

    /* enable Tx & Rx */
    ETH_CPU->ETH_ETHER_IO_CMD.b.te = 1;
    ETH_CPU->ETH_ETHER_IO_CMD.b.re = 1;

    if (ETH_InitStruct->ETH_Mode == ETH_LOOPBACK_T2R_MODE)
    {
        /* disable auto-polling */
        ETH->ETH_MIIAR.b.disable_auto_polling = 1;
        ETH->ETH_MSR.b.force_spd_mode = 1;
        ETH->ETH_MSR.b.force_spd = ETH_InitStruct->ETH_ForceSpeed;
        ETH->ETH_MSR.b.force_link = 1;
        ETH->ETH_MSR.b.force_full_dup = 1;
    }
    else
    {
        /* enable auto-polling */
        ETH->ETH_MIIAR.b.disable_auto_polling = 0;

        if (ETH_PHY_OPS.ETH_WaitPHYLinkUp != NULL)
        {
            ETH_PHY_OPS.ETH_WaitPHYLinkUp();
        }

        /* Wait MAC's link is up */
        i = 0;
        do
        {
            if ((ETH->ETH_MSR.b.link_status) == ETH_LINK_UP)
            {
                break;
            }
            else
            {
                i++;
                if (i > ETH_TIMEOUT_CNT_MAX)
                {
#ifdef DEBUG_ETH
                    ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_Init: Wait MAC's link up timeout!!", 0);
#endif
                    return ETH_STATUS_ERROR;
                }
            }
        }
        while (1);
    }

    /* Get MAC's link info. */
#ifdef DEBUG_ETH
    ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO, "ETH_Init: get mac link info = 0x%x", 1,
                   ETH->ETH_MSR.d32);
    ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO, "[ETH_Init] link speed %d duplex mode %d", 2,
                   ETH_GetLinkSpeed(), ETH_GetDuplexMode());
#endif

    if (ETH_InitStruct->ETH_Mode != ETH_LOOPBACK_T2R_MODE)
    {
        if (ETH_PHY_OPS.ETH_PHYConfig != NULL)
        {
            ETH_PHY_OPS.ETH_PHYConfig(ETH_InitStruct);
        }
    }

    return ETH_STATUS_OK;
}

/**
  * \brief  Initialize ETH_InitTypeDef.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \return None.
  */
void ETH_StructInit(ETH_InitTypeDef *ETH_InitStruct)
{
    ETH_InitStruct->ETH_InterFrameGapTime = ETH_IFG_3;
    ETH_InitStruct->ETH_Mode = ETH_NORMAL_MODE;
    ETH_InitStruct->ETH_PhyMode = ETH_PHY_NORMAL_MODE;
    ETH_InitStruct->ETH_PhyRxSetupTime = ETH_PHY_DEFAULT_RX_SETUP_TIME;
    ETH_InitStruct->ETH_PhyTxSetupTime = ETH_PHY_DEFAULT_TX_SETUP_TIME;
    ETH_InitStruct->ETH_ReceiveConfig = ETH_RX_CONFIG_AAP | ETH_RX_CONFIG_APM | ETH_RX_CONFIG_AM |
                                        ETH_RX_CONFIG_AB;
    ETH_InitStruct->ETH_RxJumboConfig = ETH_RX_JUMBO_ENABLE;
    ETH_InitStruct->ETH_RxRefclkPhase = ETH_RX_SAMPLE_ON_FALLING_EDGE;
    ETH_InitStruct->ETH_TxRefclkPhase = ETH_TX_CHANGE_ON_FALLING_EDGE;
    ETH_InitStruct->ETH_RxThreshold = ETH_RX_THRESHOLD_256B;
    ETH_InitStruct->ETH_TxThreshold = ETH_TX_THRESHOLD_256B;
    ETH_InitStruct->ETH_RxTriggerLevel = ETH_RX_TRIGGER_LEVEL_1_PKT;
    ETH_InitStruct->ETH_TxTriggerLevel = ETH_TX_TRIGGER_LEVEL_1_PKT;
    ETH_InitStruct->ETH_RxDescNum = 8;
    ETH_InitStruct->ETH_TxDescNum = 8;
    ETH_InitStruct->ETH_RxDesc = NULL;
    ETH_InitStruct->ETH_TxDesc = NULL;
    ETH_InitStruct->ETH_RxPktBuf = NULL;
    ETH_InitStruct->ETH_TxPktBuf = NULL;
    ETH_InitStruct->ETH_RxDescCurrentNum = 0;
    ETH_InitStruct->ETH_TxDescCurrentNum = 0;
    ETH_InitStruct->ETH_RxFrameStartDescIdx = 0;
    ETH_InitStruct->ETH_RxFrameLen = 0;
    ETH_InitStruct->ETH_RxSegmentCount = 0;
    ETH_InitStruct->ETH_TxAllocBufSize = 1600;
    ETH_InitStruct->ETH_RxAllocBufSize = 1600;
    ETH_InitStruct->ETH_TxBufSize = 1524;
    ETH_InitStruct->ETH_RxBufSize = 1524;
    ETH_InitStruct->ETH_ForceSpeed = ETH_LOOPBACK_FORCE_SPEED_100M;

    return;
}

/**
  * \brief  Get ethernet link speed.
  * \return ETHLinkSpeed_Typedef: ethernet link speed. \ref ETHLinkSpeed_Typedef.
  */
ETHLinkSpeed_Typedef ETH_GetLinkSpeed(void)
{
    return (ETHLinkSpeed_Typedef)(ETH->ETH_MSR.b.link_speed);
}

/**
  * \brief  Get ethernet duplex mode.
  * \return ETHDuplexMode_Typedef: ethernet duplex mode. \ref ETHDuplexMode_Typedef.
  */
ETHDuplexMode_Typedef ETH_GetDuplexMode(void)
{
    return (ETHDuplexMode_Typedef)(ETH->ETH_MSR.b.full_dupreg);
}

/**
  * \brief  Enable ethernet RX.
  * \param  None.
  * \return None.
  */
void ETH_EnableRx(void)
{
    /* enable Rx ring1 */
    ETH_CPU->ETH_IO_CMD1.b.rxring1 = 1;
}

/**
  * \brief  Close the clock of ETH and disable intterrupt.
  * \param  None.
  * \return None.
  */
void ETH_DeInit(void)
{
    ETH_ClockDeInit();
}

/**
  * \brief  To send frame.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  FrameLength: The length of data to be sent.
  * \return ETHSendFrameStatus_Typedef: The result of the operation. \ref ETHSendFrameStatus_Typedef.
  */
ETHSendFrameStatus_Typedef ETH_SendFrame(ETH_InitTypeDef *ETH_InitStruct, uint32_t FrameLength)
{
    if ((ETH_InitStruct == NULL) || (FrameLength == 0))
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "ETH_SendFrame: Invalid parameter!!", 0);
#endif
        return ETH_TX_INVALID_PARAMETER;
    }

    if (FrameLength > ETH_MAX_TX_PACKET_SIZE)
    {
        return ETH_TX_PACKET_SIZE_OVERFLOW;
    }

    uint8_t tx_desc_current_num = ETH_InitStruct->ETH_TxDescCurrentNum;
    uint32_t *p = (uint32_t *)(ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].addr);
    uint32_t bufcount = 0, i = 0, size = 0;

