wolaite2024/jlab-jh5003-earphone/src/mcu/io/rtl87x3eu/rtl_ethernet.c
#ifdef DEBUG_ETH
    ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO, "ETH_SendFrame: tx_idx=%d frame_length = %d", 2,
                   tx_desc_current_num, FrameLength);
#endif

    /* Get the number of needed Tx buffers for the current frame */
    if (FrameLength > ETH_InitStruct->ETH_TxBufSize)
    {
        bufcount = FrameLength / ETH_InitStruct->ETH_TxBufSize;
        if (FrameLength % ETH_InitStruct->ETH_TxBufSize)
        {
            bufcount++;
        }
    }
    else
    {
        bufcount = 1U;
    }

    if (bufcount == 1U)
    {
        /* check if current Tx descriptor is available */
        if (!ETH_IsTxDescAvailable(ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1))
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_WARN, "ETH_SendFrame: Tx descriptor ring is full cur %d!! ", 1,
                           tx_desc_current_num);
#endif
            return ETH_TX_DSC_IS_FULL;
        }

        ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 &= ETH_TX_DESC_EOR;
        ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 |= (ETH_TX_DESC_OWN | ETH_TX_DESC_FS |
                                                                ETH_TX_DESC_LS | ETH_TX_DESC_CRC | FrameLength);
        if (tx_desc_current_num == ((ETH_InitStruct->ETH_TxDescNum) - 1))
        {
            ETH_InitStruct->ETH_TxDescCurrentNum = 0;
        }
        else
        {
            ETH_InitStruct->ETH_TxDescCurrentNum++;
        }
    }
    else
    {
        for (i = 0U; i < bufcount; i++)
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO, "ETH_SendFrame: multi tx desc tx_idx=%d", 1,
                           tx_desc_current_num);
#endif
            /* check if current Tx descriptor is available */
            if (!ETH_IsTxDescAvailable(ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1))
            {
#ifdef DEBUG_ETH
                ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_WARN, "ETH_SendFrame: Tx descriptor ring is full cur %d!! ", 1,
                               tx_desc_current_num);
#endif
                return ETH_TX_DSC_IS_FULL;
            }

            ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 &= ETH_TX_DESC_EOR;
            /* Clear FIRST and LAST segment bits */
            ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 &= ~(ETH_TX_DESC_FS | ETH_TX_DESC_LS);

            if (i == 0U)
            {
                /* Setting the first segment bit */
                ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 |= ETH_TX_DESC_FS;
            }

            if (i == (bufcount - 1U))
            {
                /* Setting the last segment bit */
                ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 |= ETH_TX_DESC_LS;
                size = FrameLength - (bufcount - 1U) * ETH_InitStruct->ETH_TxBufSize;
                ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 |= (size & 0x1ffff);
            }
            else
            {
                /* Program size */
                ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 |= (ETH_InitStruct->ETH_TxBufSize &
                                                                        0x1ffff);
            }

            /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
            ETH_InitStruct->ETH_TxDesc[tx_desc_current_num].dw1 |= (ETH_TX_DESC_OWN | ETH_TX_DESC_CRC);

            /* point to next descriptor */
            if (tx_desc_current_num == ((ETH_InitStruct->ETH_TxDescNum) - 1))
            {
                ETH_InitStruct->ETH_TxDescCurrentNum = 0;
            }
            else
            {
                ETH_InitStruct->ETH_TxDescCurrentNum++;
            }
            tx_desc_current_num = ETH_InitStruct->ETH_TxDescCurrentNum;
        }
    }

    ETH_Enable1stPriorityTxDMAETH();

    return ETH_TX_FRAME_SUCCESS;
}

/**
  * \brief  Copy data to ethernet tx buffer.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  send_data: The address of data to be sent, must be continuous.
  * \param  send_len: The len of data to be sent.
  * \return ETHSendFrameStatus_Typedef: The result of the operation. \ref ETHSendFrameStatus_Typedef.
  */
ETHSendFrameStatus_Typedef ETH_CopyDataToTxBuffer(ETH_InitTypeDef *ETH_InitStruct,
                                                  uint8_t *send_data, uint32_t send_len)
{
    if ((ETH_InitStruct == NULL) || (send_data == NULL))
    {
        return ETH_TX_INVALID_PARAMETER;
    }

    if (send_len > ETH_MAX_TX_PACKET_SIZE)
    {
        return ETH_TX_PACKET_SIZE_OVERFLOW;
    }

    uint32_t buffer_offset = 0;
    uint32_t buffer_left_to_copy = send_len;
    uint8_t tx_serach_idx = ETH_InitStruct->ETH_TxDescCurrentNum;
    uint8_t *buffer = (uint8_t *)(ETH_InitStruct->ETH_TxDesc[tx_serach_idx].addr);

    while (buffer_left_to_copy >= ETH_InitStruct->ETH_TxBufSize)
    {
        if (ETH_IsTxDescAvailable(ETH_InitStruct->ETH_TxDesc[tx_serach_idx].dw1))
        {
            memcpy(buffer, (send_data + buffer_offset), ETH_InitStruct->ETH_TxBufSize);
            buffer_offset += ETH_InitStruct->ETH_TxBufSize;
            buffer_left_to_copy -= ETH_InitStruct->ETH_TxBufSize;
            /* Point to next descriptor */
            if (tx_serach_idx == ((ETH_InitStruct->ETH_TxDescNum) - 1))
            {
                tx_serach_idx = 0;
            }
            else
            {
                tx_serach_idx++;
            }
            buffer = (uint8_t *)(ETH_InitStruct->ETH_TxDesc[tx_serach_idx].addr);
        }
        else
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_WARN,
                           "[ETH_CopyDataToTxBuffer] Tx descriptor ring is full %d !!", 1, tx_serach_idx);
#endif
            return ETH_TX_DSC_IS_FULL;
        }
    }

    if (buffer_left_to_copy != 0)
    {
        if (ETH_IsTxDescAvailable(ETH_InitStruct->ETH_TxDesc[tx_serach_idx].dw1))
        {
            memcpy(buffer, (send_data + buffer_offset), buffer_left_to_copy);
        }
        else
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_WARN,
                           "[ETH_CopyDataToTxBuffer] Tx descriptor ring is full %d !!", 1, tx_serach_idx);
#endif
            return ETH_TX_DSC_IS_FULL;
        }
    }

