wolaite2024/jlab-jh5003-earphone/src/mcu/io/rtl87x3eu/rtl_ethernet.c
    return ETH_TX_COPY_DATA_SUCCESS;
}

/**
  * \brief  Enable 1st Priority DMA-Ethernet Transmit.
  * \return none.
  */
void ETH_Enable1stPriorityTxDMAETH(void)
{
    ETH_CPU->ETH_ETHER_IO_CMD.b.tx_fn1st = 1;
}

/**
  * \brief  Check tx desc is available.
  * \return true: tx desc is available.
  *         false: tx desc is not available.
  */
bool ETH_IsTxDescAvailable(uint32_t dw1)
{
    return !(dw1 & ETH_TX_DESC_OWN);
}

/**
  * \brief  Check rx desc is available.
  * \return true: rx desc is available.
  *         false: rx desc is not available.
  */
bool ETH_IsRxDescAvailable(uint32_t dw1)
{
    return !(dw1 & ETH_RX_DESC_OWN);
}

/**
  * \brief  Get TX OK count.
  * \return TX OK count, rolls over automatically.
  */
uint16_t ETH_GetTxOkCnt(void)
{
    return ETH->ETH_TXOKCNT.d16;
}

/**
  * \brief  Clear TX OK count.
  * \return none.
  */
void ETH_ClearTxOkCnt(void)
{
    ETH->ETH_TXOKCNT.d16 = 1;
}

/**
  * \brief  Get RX OK count.
  * \return RX OK count, rolls over automatically.
  */
uint16_t ETH_GetRxOkCnt(void)
{
    return ETH->ETH_RXOKCNT.d16;
}

/**
  * \brief  Clear RX OK count.
  * \return none.
  */
void ETH_ClearRxOkCnt(void)
{
    ETH->ETH_RXOKCNT.d16 = 1;
}

/**
  * \brief  Get TX error count.
  * \return TX error count, rolls over automatically.
  */
uint16_t ETH_GetTxErrCnt(void)
{
    return ETH->ETH_TXERR.d16;
}

/**
  * \brief  Clear TX error count.
  * \return none.
  */
void ETH_ClearTxErrCnt(void)
{
    ETH->ETH_TXERR.d16 = 1;
}

/**
  * \brief  Get RX error count.
  * \return RX error count, rolls over automatically.
  */
uint16_t ETH_GetRxErrCnt(void)
{
    return ETH->ETH_RXERR.d16;
}

/**
  * \brief  Clear RX error count.
  * \return none.
  */
void ETH_ClearRxErrCnt(void)
{
    ETH->ETH_RXERR.d16 = 1;
}

/**
  * \brief  Get missed packets count.
  * \return Missed packets count, rolls over automatically.
  */
uint16_t ETH_GetMissedPacketCnt(void)
{
    return ETH->ETH_MISSPKT.d16;
}

/**
  * \brief  Clear missed packets count.
  * \return none.
  */
void ETH_ClearMissedPacketCnt(void)
{
    ETH->ETH_MISSPKT.d16 = 1;
}

/**
  * \brief  Config ethernet interrupt.
  * \param  ETH_INT: The interrupt of ethernet. \ref ETHINT_TypeDef.
  * \param  newState: Disable or enable ethernet interrupt.
  * \return none.
  */
void ETH_INTConfig(ETHINT_TypeDef ETH_INT, FunctionalState newState)
{
    /* Check the parameters */
    assert_param(IS_ETH_INT(ETH_INT));

    ETH_ISR_IMR_TypeDef eth_reg_0x3c = {.d32 = ETH->ETH_ISR_IMR.d32};

    eth_reg_0x3c.d32 &= 0xffff0000;

    if (newState == ENABLE)
    {
        eth_reg_0x3c.d32 |= (ETH_INT << 16);
    }
    else
    {
        eth_reg_0x3c.d32 &= (~(ETH_INT << 16));
    }

    ETH->ETH_ISR_IMR.d32 = eth_reg_0x3c.d32;
}

/**
  * \brief  Check ethernet interrupt is enable.
  * \param  ETH_INT: The interrupt of ethernet. \ref ETHINT_TypeDef.
  * \return SET: The interrupt is enable.
  *         RESET: The interrupt is disable.
  */
ITStatus ETH_IsINTEnable(ETHINT_TypeDef ETH_INT)
{
    ITStatus bit_status = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_INT(ETH_INT));

    if ((ETH->ETH_ISR_IMR.d32 & (ETH_INT << 16)) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    /* Return the status */
    return  bit_status;
}

/**
  * \brief  Get ethernet interrupt status.
  * \param  ETH_INT: The interrupt of ethernet. \ref ETHINT_TypeDef.
  * \return SET: The interrupt is pending.
  *         RESET: The interrupt is not pending.
  */
ITStatus ETH_GetINTStatus(ETHINT_TypeDef ETH_INT)
{
    ITStatus bit_status = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_INT(ETH_INT));

    if ((ETH->ETH_ISR_IMR.d32 & ETH_INT) != (uint32_t)RESET)
    {
        bit_status = SET;
    }
    /* Return the status */
    return  bit_status;
}

/**
  * \brief  Clear ethernet interrupt status.
  * \param  ETH_INT: The interrupt of ethernet. \ref ETHINT_TypeDef.
  * \return none
  */
void ETH_ClearINTStatus(ETHINT_TypeDef ETH_INT)
{
    /* Check the parameters */
    assert_param(IS_ETH_INT_STATUS(status));
    ETH_ISR_IMR_TypeDef eth_reg_0x3c = {.d32 = ETH->ETH_ISR_IMR.d32};

    eth_reg_0x3c.d32 &= 0xffff0000;
    eth_reg_0x3c.d32 |= ETH_INT;

    ETH->ETH_ISR_IMR.d32 = eth_reg_0x3c.d32;
}

/**
  * \brief  Get ethernet link status.
  * \return ETHLinkStatus_Typedef: ethernet link status. \ref ETHLinkStatus_Typedef.
  */
ETHLinkStatus_Typedef ETH_GetLinkStatus(void)
{
    if (ETH->ETH_MSR.b.link_status)
    {
        return ETH_LINK_DOWN;
    }
    else
    {
        return ETH_LINK_UP;
    }
}

/**
  * \brief  Set rx desc back to ethernet.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  rx_desc_index: Rx desc index.
  * \param  buffer_size: Rx desc buffer size.
  * \return none.
  */
void ETH_SetRxDescBackToETH(ETH_InitTypeDef *ETH_InitStruct, uint8_t rx_desc_index,
                            uint16_t buffer_size)
{
    ETH_InitStruct->ETH_RxDesc[rx_desc_index].dw1 &= BIT30;
    ETH_InitStruct->ETH_RxDesc[rx_desc_index].dw1 |= (BIT31 | buffer_size);
    ETH_InitStruct->ETH_RxDesc[rx_desc_index].dw2 = 0;
    ETH_InitStruct->ETH_RxDesc[rx_desc_index].dw3 = 0;
}

/**
  * \brief  To receive frame.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \return ETHReceiveFrameStatus_Typedef: receive frame result. \ref ETHReceiveFrameStatus_Typedef.
  */
ETHReceiveFrameStatus_Typedef ETH_ReceiveFrame(ETH_InitTypeDef *ETH_InitStruct)
{
    if (ETH_InitStruct == NULL)
    {
#ifdef DEBUG_ETH
        ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "[ETH_ReceiveFrame] Invalid parameter!!", 0);
#endif
        return ETH_RX_INVALID_PARAMETER;
    }

    uint8_t rx_desc_current_num = ETH_InitStruct->ETH_RxDescCurrentNum;
    uint8_t *buffer;
    bool is_rx_data_received = false;

#ifdef DEBUG_ETH
    ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO, "ETH_ReceiveFrame: rx_idx=%d\n", 1, rx_desc_current_num);
#endif

    while (ETH_IsRxDescAvailable(ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1))
    {
        is_rx_data_received = true;
        /* Check if last segment */
        if (((ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1 & ETH_RX_DESC_LS) != (uint32_t)RESET))
        {
            /* increment segment count */
            ETH_InitStruct->ETH_RxSegmentCount++;
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO,
                           "[ETH_ReceiveFrame] end frame, seg_count=%d,frame_len=%d", 2, ETH_InitStruct->ETH_RxSegmentCount,
                           (ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) & 0xFFF);
#endif
            /* Check if last segment is first segment: one segment contains the frame */
            if (ETH_InitStruct->ETH_RxSegmentCount == 1U)
            {
                ETH_InitStruct->ETH_RxFrameStartDescIdx = rx_desc_current_num;
                ETH_InitStruct->ETH_RxFrameLen = 0;
            }

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            if (((ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) & 0xFFF) >= 4)
            {
                ETH_InitStruct->ETH_RxFrameLen += ((ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) &
                                                   0xFFF) - 4;
            }
            else
            {
#ifdef DEBUG_ETH
                ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_ERROR, "[ETH_ReceiveFrame] rx data len error", 0);
#endif
                break;
            }

            /* point to next descriptor */
            if (rx_desc_current_num != ((ETH_InitStruct->ETH_RxDescNum) - 1))
            {
                ETH_InitStruct->ETH_RxDescCurrentNum++;
            }
            else
            {
                ETH_InitStruct->ETH_RxDescCurrentNum = 0;
            }

