wolaite2024/jlab-jh5003-earphone/src/mcu/io/rtl87x3eu/rtl_ethernet.c
            /* Receive frame success */
            return ETH_RX_FRAME_SUCCESS;
        }
        /* Check if first segment */
        else if ((ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1 & ETH_RX_DESC_FS) !=
                 (uint32_t)RESET)
        {
            ETH_InitStruct->ETH_RxFrameStartDescIdx = rx_desc_current_num;
            ETH_InitStruct->ETH_RxSegmentCount = 1U;

            ETH_InitStruct->ETH_RxFrameLen = ((ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) &
                                              0xFFF);
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO,
                           "ETH_ReceiveFrame: start frame frame_len=%d,rx_frame_len=%d", 2,
                           (ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) & 0xFFF, ETH_InitStruct->ETH_RxFrameLen);
#endif
        }
        /* Check if intermediate segment */
        else
        {
#ifdef DEBUG_ETH
            ETH_DBG_BUFFER(ETH_DBG_MODULE, LEVEL_INFO,
                           "ETH_ReceiveFrame: middle frame frame_len=%d,rx_frame_len=%d", 2,
                           (ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) & 0xFFF, ETH_InitStruct->ETH_RxFrameLen);
#endif
            ETH_InitStruct->ETH_RxSegmentCount++;

            ETH_InitStruct->ETH_RxFrameLen += ((ETH_InitStruct->ETH_RxDesc[rx_desc_current_num].dw1) &
                                               0xFFF);
        }

        if (rx_desc_current_num != ((ETH_InitStruct->ETH_RxDescNum) - 1))
        {
            ETH_InitStruct->ETH_RxDescCurrentNum++;
        }
        else
        {
            ETH_InitStruct->ETH_RxDescCurrentNum = 0;
        }

        rx_desc_current_num = ETH_InitStruct->ETH_RxDescCurrentNum;
    }

    if (is_rx_data_received == false)
    {
        return ETH_RX_NO_DATA;
    }

    return ETH_RX_FRAME_ERROR;
}

/**
  * \brief  Copy ethernet rx buffer to data.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  ETH_InitStruct: The pointer to ETH_InitTypeDef.
  * \param  recv_data: The address of data to be received, must be continuous.
  * \param  recv_len: The len of data to be received.
  * \param  data_size: The len of recv_data, must be large enough to receive data.
  * \return ETHReceiveFrameStatus_Typedef: copy frame result. \ref ETHReceiveFrameStatus_Typedef.
  */
ETHReceiveFrameStatus_Typedef ETH_CopyRxBufferToData(ETH_InitTypeDef *ETH_InitStruct,
                                                     uint8_t *recv_data, uint32_t *recv_len, uint32_t data_size)
{
    if ((ETH_InitStruct == NULL) || (recv_data == NULL) || (recv_len == NULL))
    {
        return ETH_RX_INVALID_PARAMETER;
    }

    uint8_t rx_serach_idx = ETH_InitStruct->ETH_RxFrameStartDescIdx;

    *recv_len = ETH_InitStruct->ETH_RxFrameLen;

    if (data_size < ETH_InitStruct->ETH_RxFrameLen)
    {
        return ETH_RX_COPY_DATA_LEN_ERROR;
    }

    if (ETH_InitStruct->ETH_RxSegmentCount == 1)
    {
        /* The data of first desc has two bytes offset */
        memcpy(recv_data, (uint8_t *)((ETH_InitStruct->ETH_RxDesc[rx_serach_idx].addr) +
                                      ETH_RX_PACKET_FIRST_DESC_DATA_OFFSET), ETH_InitStruct->ETH_RxFrameLen);
    }
    else
    {
        uint32_t buffer_offset = 0;
        uint32_t buffer_left_to_copy = ETH_InitStruct->ETH_RxFrameLen;

        for (uint32_t i = 0; i < ETH_InitStruct->ETH_RxSegmentCount; i++)
        {
            if (i == 0)
            {
                /* The data of first desc has two bytes offset */
                memcpy(recv_data, (uint8_t *)((ETH_InitStruct->ETH_RxDesc[rx_serach_idx].addr) +
                                              ETH_RX_PACKET_FIRST_DESC_DATA_OFFSET),
                       ETH_InitStruct->ETH_RxBufSize - ETH_RX_PACKET_FIRST_DESC_DATA_OFFSET);
                buffer_offset = ETH_InitStruct->ETH_RxBufSize - 2;
                buffer_left_to_copy -= buffer_offset;
            }
            else
            {
                if (buffer_left_to_copy > ETH_InitStruct->ETH_RxBufSize)
                {
                    memcpy((recv_data + buffer_offset), (uint8_t *)((ETH_InitStruct->ETH_RxDesc[rx_serach_idx].addr)),
                           ETH_InitStruct->ETH_RxBufSize);
                    buffer_offset += ETH_InitStruct->ETH_RxBufSize;
                    buffer_left_to_copy -= ETH_InitStruct->ETH_RxBufSize;
                }
                else
                {
                    memcpy((recv_data + buffer_offset), (uint8_t *)((ETH_InitStruct->ETH_RxDesc[rx_serach_idx].addr)),
                           buffer_left_to_copy);
                }
            }

            /* Point to next descriptor */
            if (rx_serach_idx == ((ETH_InitStruct->ETH_RxDescNum) - 1))
            {
                rx_serach_idx = 0;
            }
            else
            {
                rx_serach_idx++;
            }
        }
    }

    rx_serach_idx = ETH_InitStruct->ETH_RxFrameStartDescIdx;
    for (uint32_t i = 0; i < ETH_InitStruct->ETH_RxSegmentCount; i++)
    {
        ETH_SetRxDescBackToETH(ETH_InitStruct, rx_serach_idx, ETH_InitStruct->ETH_RxBufSize);
        if (rx_serach_idx == ((ETH_InitStruct->ETH_RxDescNum) - 1))
        {
            rx_serach_idx = 0;
        }
        else
        {
            rx_serach_idx++;
        }
    }

    return ETH_RX_COPY_DATA_SUCCESS;
}

/******************* (C) COPYRIGHT 2024 Realtek Semiconductor Corporation *****END OF FILE****/
